---
kind: property
id: P:Autodesk.Revit.DB.SlabShapeCrease.EndPoints
source: html/e55954a9-8b9a-6578-c3c0-e35187b2867e.htm
---
# Autodesk.Revit.DB.SlabShapeCrease.EndPoints Property

The vertices of the crease.

## Syntax (C#)
```csharp
public SlabShapeVertexArray EndPoints { get; }
```